Project/Toir/src/InformationRegisters/торо_Переводы/торо_Переводы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_Переводы</name>
  <resources>
    <name>Текст</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>ID</name>
    <type>
      <types>AnyRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Язык</name>
    <type>
      <types>CatalogRef.торо_Языки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Реквизит</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/CommonModules/торо_ЛокализацияАвтоформы/Module.bsl
#Область ПрограммныйИнтерфейс

#Область Обработчики_событий_автоформы

// [Обработчик события ПриСозданииНаСервере автоформы] 
Процедура ПриСозданииСтандартнойФормы(Форма, Отказ, СтандартнаяОбработка) Экспорт
	Если ЭтоЯзыкПоУмолчанию() Тогда
		Возврат
	КонецЕсли;
	
	Если Форма.Параметры.Свойство("ВидФормы") 
		И (Форма.Параметры.ВидФормы = "ФормаСписка" 
		ИЛИ Форма.Параметры.ВидФормы = "ФормаВыбора") Тогда 
		
		МассивРеквизитов = Новый Массив;
		Список = Новый РеквизитФормы("Список", Новый ОписаниеТипов("ДинамическийСписок"),,, Истина);
		МассивРеквизитов.Добавить(Список);
		МассивРеквизитов.Добавить(Новый РеквизитФормы("торо_ПутьКСправке", Новый ОписаниеТипов("Строка")));
		Форма.ИзменитьРеквизиты(МассивРеквизитов);
		ПостроитьДинамическийСписокформы(Форма);
		
		Для Каждого СМ Из Форма.Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы Цикл
			Форма.Элементы.Переместить(СМ, Форма.Элементы.СписокКоманднаяПанель);
		КонецЦикла;
		Форма.Элементы.ФормаКоманднаяПанель.Видимость = Ложь;
		Форма.Заголовок = Метаданные[Форма.Параметры.ТипМетаданных][Форма.Параметры.ТипОбъектаИБ].Синоним;
		Форма.АвтоЗаголовок = Ложь;
		
		ДобавитьКнопкиНаФорму(Форма, Форма.Параметры.ТипМетаданных, Форма.Параметры.ВидФормы);
		
		Если Форма.Параметры.ТипМетаданных = "Справочники" Тогда 
			Форма["торо_ПутьКСправке"] = "Справочник." + Форма.Параметры.ТипОбъектаИБ;
		ИначеЕсли Форма.Параметры.ТипМетаданных = "Документы" Тогда 
			Форма["торо_ПутьКСправке"] = "Документ." + Форма.Параметры.ТипОбъектаИБ;
		КонецЕсли;
		
		Если Форма.Параметры.ВидФормы <> "ФормаСписка" Тогда
			Форма.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
		КонецЕсли; 

	ИначеЕсли Форма.Параметры.Свойство("Ключ") Тогда 
		Форма.РежимОткрытияОкна = РежимОткрытияОкнаФормы.БлокироватьОкноВладельца;
		ОбъектФормы = Форма.Параметры.Ключ;
		МассивТипов = Новый Массив;
		МассивТипов.Добавить(ТипЗнч(ОбъектФормы));
		ТипОбъекта = ПолучитьИмяБазовогоТипаПоТипуОбъекта(ТипЗнч(ОбъектФормы));
			
		МассивРеквизитов = Новый Массив;
		Объект = Новый РеквизитФормы("Объект", Новый ОписаниеТипов(МассивТипов),,, Истина);
		МассивРеквизитов.Добавить(Объект);
		МассивРеквизитов.Добавить(Новый РеквизитФормы("торо_ПутьКСправке", Новый ОписаниеТипов("Строка")));
		Форма.ИзменитьРеквизиты(МассивРеквизитов);
		
		Форма.ЗначениеВРеквизитФормы(ОбъектФормы, "Объект");
		Если Не ТипОбъекта = "РегистрыСведений" Тогда 
			Если Форма.Объект.Свойство("Номер") Тогда
				Номер = Форма.Элементы.Добавить("Номер", Тип("ПолеФормы"), Форма);
				Номер.Вид = ВидПоляФормы.ПолеВвода;
				Номер.ПутьКДанным = "Объект.Номер";
			КонецЕсли;
			
			Если Форма.Объект.Свойство("Код") Тогда
				Номер = Форма.Элементы.Добавить("Код", Тип("ПолеФормы"), Форма);
				Номер.Вид = ВидПоляФормы.ПолеВвода;
				Номер.РастягиватьПоГоризонтали = Ложь;
				Номер.ПутьКДанным = "Объект.Код";
			КонецЕсли;
			
			Если Форма.Объект.Свойство("Дата") Тогда
				Номер = Форма.Элементы.Добавить("Дата", Тип("ПолеФормы"), Форма);
				Номер.Вид = ВидПоляФормы.ПолеВвода;
				Номер.ПутьКДанным = "Объект.Дата";
			КонецЕсли; 

			Если Форма.Объект.Свойство("Наименование") Тогда
				Наименование = Форма.Элементы.Добавить("Наименование", Тип("ПолеФормы"), Форма);
				Наименование.Вид = ВидПоляФормы.ПолеВвода;
				Наименование.ПутьКДанным = "Объект.Наименование";
			КонецЕсли; 
		КонецЕсли;
		ДобавитьРеквизитыНаФорму(Форма, ОбъектФормы, ТипОбъекта);
		ДобавитьКнопкиНаФорму(Форма, ТипОбъекта);
		//
		Форма.Заголовок = Форма.Параметры.Ключ.Метаданные().Синоним;
		Если ТипОбъекта = "Справочники" Тогда 
			Форма["торо_ПутьКСправке"] = "Справочник." + Форма.Параметры.Ключ.Метаданные().Имя;
			Форма.Заголовок = ?(ЗначениеЗаполнено(Форма.Объект.Ссылка), Строка(Форма.Объект.Ссылка) 
			+ " (" + Форма.Заголовок + ")", Форма.Заголовок + " (" + НСтр("ru='Создание';en='Creature'") + ")");
		ИначеЕсли ТипОбъекта = "Документы" Тогда 
			Форма["торо_ПутьКСправке"] = "Документ." + Форма.Параметры.Ключ.Метаданные().Имя;
			Форма.Заголовок = ?(ЗначениеЗаполнено(Форма.Объект.Ссылка), Строка(Форма.Объект.Ссылка) + 
			" (" + Форма.Заголовок + ")", Форма.Заголовок + " (" + НСтр("ru='Создание';en='Creature'") + ")");
		ИначеЕсли ТипОбъекта = "РегистрыСведений" Тогда 
			Форма["торо_ПутьКСправке"] = "РегистрСведений." + Форма.Параметры.ТипОбъектаИБ;
		КонецЕсли;
		
		Форма.АвтоЗаголовок = Ложь;
	КонецЕсли;
КонецПроцедуры

// [Обработчик события ПередЗаписьюНаСервере автоформы] 
Процедура ПередЗаписьюНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи) Экспорт
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	МассивРеквизитов = Новый Массив();
	
	Реквизиты = ЭтаФорма.ПолучитьРеквизиты();
	Для каждого Реквизит Из Реквизиты Цикл
		Если СтрНачинаетсяС(Реквизит.Имя, "замена_") Тогда
			ИмяРеквизита = СтрРазделить(Реквизит.Имя, "_", Ложь)[1];
			ЗначениеРеквизита = ЭтаФорма[Реквизит.Имя];
			СтароеЗначение = ЭтаФорма.Объект[ИмяРеквизита];
			
			Если ЗначениеРеквизита <> СтароеЗначение Тогда
				МассивРеквизитов.Добавить(Новый Структура("Имя,Значение", ИмяРеквизита, ЗначениеРеквизита));
				Если ЗначениеЗаполнено(СтароеЗначение) = Ложь Тогда 
					ЭтаФорма.Объект[ИмяРеквизита] = ЗначениеРеквизита;
				КонецЕсли;
			КонецЕсли; 
		КонецЕсли; 
	КонецЦикла; 
	ПараметрыЗаписи.Вставить("МассивРеквизитов", МассивРеквизитов);
КонецПроцедуры

// [Обработчик события ПослеЗаписиНаСервере автоформы] 
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи) Экспорт
	Если ПараметрыЗаписи.Свойство("МассивРеквизитов") Тогда 
		Язык = Справочники.торо_Языки.НайтиПоКоду(ТекущийЯзык().КодЯзыка);
		Для каждого ПараметрЗаписи Из ПараметрыЗаписи.МассивРеквизитов Цикл
			
			Реквизит 	= ПараметрЗаписи.Имя;
			Текст 		= ПараметрЗаписи.Значение;
			ID 			= ТекущийОбъект.Ссылка;
			Отбор = Новый Структура("ID,Язык,Реквизит,Текст", ID, Язык, Реквизит, Текст); 
			
			МЗ = РегистрыСведений.торо_Переводы.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(МЗ, Отбор);
			МЗ.Записать();
		КонецЦикла; 
	КонецЕсли;
КонецПроцедуры

// [Вызывается для локализации элементов уже созданной формы] 
Процедура ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка) Экспорт
	Если ЭтоЯзыкПоУмолчанию() Тогда
		Возврат;
	КонецЕсли;

	Если ТипЗнч(ЭтаФорма) = Тип("Булево") И Не ЭтаФорма Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтаФорма.Параметры.Свойство("ТипМетаданных") 
		И ЭтаФорма.Параметры.ТипМетаданных = "РегистрыСведений" Тогда 
		Возврат;
	КонецЕсли;
	Если ЭтаФорма.Параметры.Свойство("ВидФормы") 
		И (ЭтаФорма.Параметры.ВидФормы = "ФормаСписка" 
		ИЛИ ЭтаФорма.Параметры.ВидФормы = "ФормаВыбора") Тогда 
		Возврат;
	КонецЕсли;
	
	ДобавляемыеРеквизиты = Новый Массив;
	СоотвРеквизитов = Новый Соответствие;
	СтарыйНовый = Новый Соответствие;
	
	СтроковыеРеквизиты = Новый Массив;
	РеквизитыОбъекта = Этаформа.ПолучитьРеквизиты("Объект");
	Для каждого РеквизитОбъекта Из РеквизитыОбъекта Цикл
		Если РеквизитОбъекта.ТипЗначения.СодержитТип(Тип("Строка")) Тогда
			Если РеквизитОбъекта.Имя <> "Код" Тогда
				СтроковыеРеквизиты.Добавить(РеквизитОбъекта);
			КонецЕсли; 
		КонецЕсли; 
	КонецЦикла; 
	
	ЭлементыФормы = Новый Соответствие;
	Для каждого Элемент Из ЭтаФорма.Элементы Цикл
		Если ТипЗнч(Элемент) = Тип("ПолеФормы") Тогда
			ЭлементыФормы.Вставить(Элемент.ПутьКДанным, Элемент);
		КонецЕсли; 
	КонецЦикла;
	
	ЗаголовкиЭлементов = Новый Массив;
	Для каждого СтроковыйРеквизит Из СтроковыеРеквизиты Цикл
		ПутьКДанным = СтрШаблон("%1.%2", СтроковыйРеквизит.Путь, СтроковыйРеквизит.Имя);
		ЭлементРеквизита = ЭлементыФормы[ПутьКДанным];
		ИмяРеквизита = СтроковыйРеквизит.Имя;
		НовоеИмяРеквизита = СтрШаблон("замена_%1", ИмяРеквизита);
		
		Если ЭлементРеквизита <> Неопределено Тогда
			Строка = Новый Структура("Элемент,Заголовок,ИмяРеквизита,НовоеИмяРеквизита",
			ЭлементРеквизита, СтроковыйРеквизит.Заголовок, СтроковыйРеквизит.Имя, НовоеИмяРеквизита); 
			ЗаголовкиЭлементов.Добавить(Строка);
			СтарыйНовый.Вставить(НовоеИмяРеквизита, ИмяРеквизита);
		КонецЕсли; 
	КонецЦикла; 
	
	Для каждого Элемент Из ЗаголовкиЭлементов Цикл
		ИмяРеквизита = Элемент.НовоеИмяРеквизита;
		Заголовок = Элемент.Заголовок;
		НовыйРеквизит = Новый РеквизитФормы(ИмяРеквизита, Новый ОписаниеТипов("Строка"), , Заголовок, Истина);
		ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
	КонецЦикла;
	
	ЭтаФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	Язык = Справочники.торо_Языки.НайтиПоКоду(ТекущийЯзык().КодЯзыка);
	
	Для каждого Элемент Из ЗаголовкиЭлементов Цикл
		ИмяРеквизита = Элемент.НовоеИмяРеквизита;
		ЭлементФормы = Элемент.Элемент;
		
		НовыйЭлемент = ЭтаФорма.Элементы.Вставить(ИмяРеквизита, Тип("ПолеФормы"), ЭлементФормы.Родитель, ЭлементФормы);
		НовыйЭлемент.ПутьКДанным = ИмяРеквизита;
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		
		ЭлементФормы.Видимость = Ложь;
		
		ИсходныйРеквизит = СтарыйНовый[Элемент.НовоеИмяРеквизита];
		ЗначениеРеквизита = ПолучитьЗначениеРеквизитаОбъекта(ЭтаФорма.Объект.Ссылка, ИсходныйРеквизит, Язык);
		
		Если ЗначениеЗаполнено(ЗначениеРеквизита) Тогда
			ЭтаФорма[ИмяРеквизита] = ЗначениеРеквизита;
		Иначе
			ЭтаФорма[ИмяРеквизита] = ЭтаФорма.Объект[Элемент.ИмяРеквизита];
		КонецЕсли; 
	КонецЦикла; 
КонецПроцедуры

#КонецОбласти 

// Локализует динамические списки
Процедура МодифицироватьСписокДляПеревода(Список, МассивРеквизитов = Неопределено)Экспорт
	Если Не СтрНайти(Список.ТекстЗапроса,"РегистрСведений.Переводы") = 0 
			ИЛИ (Не МассивРеквизитов = Неопределено И МассивРеквизитов.Количество() = 0) Тогда 
		Возврат;
	КонецЕсли;
	
	Если ЭтоЯзыкПоУмолчанию() Тогда
		Возврат
	КонецЕсли;
	
	Если СтрНачинаетсяС(Список.ТекстЗапроса, "//Локализация") Тогда
		ИмяТаблицы = Список.ОсновнаяТаблица;
	Иначе
		ИмяТаблицы = "Таблица";
	КонецЕсли; 
	
	Если МассивРеквизитов = Неопределено Тогда 
		Если СтрНайти(ИмяТаблицы,"Справочник") > 0 Тогда 
			ТипМетаданных = "Справочники";
			МетаданныеРеквизиты = Новый Массив;
			МетаданныеРеквизитыСправочника = Метаданные.Справочники[СтрЗаменить(ИмяТаблицы, "Справочник.", "")].Реквизиты;
			
			Для каждого РеквизитСправочника Из МетаданныеРеквизитыСправочника Цикл
				МетаданныеРеквизиты.Добавить(РеквизитСправочника);
			КонецЦикла; 
			
			МетаданныеРеквизиты.Добавить(Метаданные.Справочники[СтрЗаменить(ИмяТаблицы,
				"Справочник.", "")].СтандартныеРеквизиты["Наименование"]);
			ИмяТаблицы = "ТЧ";
		ИначеЕсли СтрНайти(ИмяТаблицы, "Документ") > 0 Тогда 
			ТипМетаданных = "Документы";
			МетаданныеРеквизиты = Метаданные.Документы[СтрЗаменить(ИмяТаблицы, "Документ.", "")].Реквизиты;
			ИмяТаблицы = "ТЧ";		
		Иначе
			Возврат;
		КонецЕсли;
	
		МассивРеквизитов = Новый Массив();
		ИскомыйТип = Тип("Строка");
		Для Каждого Реквизит Из МетаданныеРеквизиты Цикл
			Если Реквизит.Тип.СодержитТип(ИскомыйТип) Тогда 
				МассивРеквизитов.Добавить(Реквизит.Имя);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	ЕстьСвязи = Ложь;
	Для Каждого СМ Из МассивРеквизитов Цикл
		НачалоПоиска = СтрНайти(Список.ТекстЗапроса, " КАК " + СМ, НаправлениеПоиска.СКонца);
		Если НачалоПоиска > 0 Тогда 
			КонецПоиска = СтрНайти(Список.ТекстЗапроса, "	", НаправлениеПоиска.СКонца, НачалоПоиска - 1) + 1;
			ТекстЗамены = Сред(Список.ТекстЗапроса, КонецПоиска, НачалоПоиска - КонецПоиска);
			Список.ТекстЗапроса = СтрЗаменить(Список.ТекстЗапроса, 
				ТекстЗамены, "ЕстьNull(ВЫРАЗИТЬ(ТЧ" + СМ + ".Текст КАК СТРОКА(1000))," + ТекстЗамены + ")");
			Список.ТекстЗапроса = Список.ТекстЗапроса + "
			|	Левое Соединение РегистрСведений.торо_Переводы КАК ТЧ" + СМ + "
			|	ПО " + ИмяТаблицы + ".Ссылка = ТЧ" + СМ + ".ID
			|	И (ТЧ" + СМ + ".Реквизит = """ + СМ + """)
			|	И (ТЧ" + СМ + ".Язык = &Язык)";
			ЕстьСвязи = Истина;
		КонецЕсли;
	КонецЦикла;
	Если ЕстьСвязи Тогда 
		Язык = Справочники.торо_Языки.НайтиПоКоду(ТекущийЯзык().КодЯзыка);
		Список.Параметры.УстановитьЗначениеПараметра("Язык", Язык);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти 

#Область Вспомогательное

// [Наполняет автоформу реквизитами] 
Процедура ДобавитьРеквизитыНаФорму(Форма, ОбъектФормы, ТипОбъекта)
	Если ТипОбъекта = "РегистрыСведений" Тогда 
		Для Каждого СМ ИЗ Форма.Параметры.МассивИзмерений Цикл
			НЭлем = Форма.Элементы.Добавить(СМ, Тип("ПолеФормы"), Форма);
			//
			Если ТипЗнч(ОбъектФормы[СМ]) = Тип("Булево") Тогда 
				НЭлем.Вид = ВидПоляФормы.ПолеФлажка;
			Иначе
				НЭлем.Вид = ВидПоляФормы.ПолеВвода;
			КонецЕсли;
			//
			НЭлем.ПутьКДанным = "Объект."+СМ;
		КонецЦикла;
		Для Каждого СМ ИЗ Форма.Параметры.МассивРесурсов Цикл
			НЭлем = Форма.Элементы.Добавить(СМ, Тип("ПолеФормы"), Форма);
			//
			Если ТипЗнч(ОбъектФормы[СМ]) = Тип("Булево") Тогда 
				НЭлем.Вид = ВидПоляФормы.ПолеФлажка;
			Иначе
				НЭлем.Вид = ВидПоляФормы.ПолеВвода;
			КонецЕсли;
			//
			НЭлем.ПутьКДанным = "Объект."+СМ;
		КонецЦикла;
		Для Каждого СМ ИЗ Форма.Параметры.МассивРеквизитов Цикл
			НЭлем = Форма.Элементы.Добавить(СМ, Тип("ПолеФормы"), Форма);
			//
			Если ТипЗнч(ОбъектФормы[СМ]) = Тип("Булево") Тогда 
				НЭлем.Вид = ВидПоляФормы.ПолеФлажка;
			Иначе
				НЭлем.Вид = ВидПоляФормы.ПолеВвода;
			КонецЕсли;
			//
			НЭлем.ПутьКДанным = "Объект."+СМ;
		КонецЦикла;
	ИначеЕсли ТипОбъекта = "Документы" ИЛИ ТипОбъекта = "Справочники" Тогда 
		Для Каждого СМ Из ОбъектФормы.Метаданные().Реквизиты Цикл
			НЭлем = Форма.Элементы.Добавить(СМ.Имя, Тип("ПолеФормы"), Форма);
			//
			Если СМ.Тип = Новый ОписаниеТипов("Булево") Тогда 
				НЭлем.Вид = ВидПоляФормы.ПолеФлажка;
			Иначе
				НЭлем.Вид = ВидПоляФормы.ПолеВвода;
			КонецЕсли;
			//
			НЭлем.ПутьКДанным = "Объект."+СМ.Имя;
		КонецЦикла;
		ГруппаСтраницСоздана = Ложь;
		Для Каждого СМ Из ОбъектФормы.Метаданные().ТабличныеЧасти Цикл
			Если ГруппаСтраницСоздана = Ложь Тогда 
				ГруппаСтраницСоздана = Истина;
				нСтран = Форма.Элементы.Добавить("ГруппаСтраницы",Тип("ГруппаФормы"),Форма);
				нСтран.Вид = ВидГруппыФормы.Страницы;
			КонецЕсли;
			нСтран = Форма.Элементы.Добавить("Страница_"+СМ.Имя,Тип("ГруппаФормы"),Форма.Элементы["ГруппаСтраницы"]);
			нСтран.Вид = ВидГруппыФормы.Страница;
			нСтран.Заголовок = СМ.Синоним;// если тут не подтянется синоним из другого языка то переделаем
			Если ЗначениеЗаполнено(нСтран.Заголовок) = Ложь Тогда 
				нСтран.Заголовок = СМ.Имя;
			КонецЕсли;
			
			нТабл = Форма.Элементы.Добавить("Таблица_"+СМ.Имя,Тип("ТаблицаФормы"),Форма.Элементы["Страница_"+СМ.Имя]);
			нТабл.ПутьКДанным = "Объект."+СМ.Имя;
			Для Каждого СМ1 Из СМ.Реквизиты Цикл
				НЭлем = Форма.Элементы.Добавить(СМ1.Имя, Тип("ПолеФормы"), Форма.Элементы["Таблица_"+СМ.Имя]);
				//
				Если СМ1.Тип = Новый ОписаниеТипов("Булево") Тогда 
					НЭлем.Вид = ВидПоляФормы.ПолеФлажка;
				// у строк разная длинна. нужно сравнивать по другому.
				//ИначеЕсли СМ1.Тип = Новый ОписаниеТипов("Строка") Тогда 
				//	НЭлем.Вид = ВидПоляФормы.ПолеВвода;
				//	НЭлем.АвтоВысотаЯчейки = Истина;
				Иначе
					НЭлем.Вид = ВидПоляФормы.ПолеВвода;
				КонецЕсли;
				//
				НЭлем.ПутьКДанным = "Объект."+СМ.Имя+"."+СМ1.Имя;
			КонецЦикла;
			
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

// [Наполняет автоформу кнопками стандартных действий] 
Процедура ДобавитьКнопкиНаФорму(Форма, ТипОбъекта = Неопределено, ВидФормы = Неопределено)
	Если ВидФормы = "ФормаСписка" Тогда 
		
	ИначеЕсли ВидФормы = "ФормаВыбора" Тогда 
		нКом = Форма.Команды.Добавить("Команда_Выбрать");
		// &НаКлиенте (Команда)
		нКом.Действие = "Выбрать";
		нКом.Заголовок = НСтр("ru='Выбрать';en='Choose'");
		
		нКноп = Форма.Элементы.Добавить("Кнопка_Выбрать",Тип("КнопкаФормы"),Форма.Элементы["СписокКоманднаяПанель"]);
		нКноп.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
		нКноп.ИмяКоманды = "Команда_Выбрать";
		нКноп.КнопкаПоУмолчанию = Истина;
		нКноп.Картинка = БиблиотекаКартинок.ВыбратьЗначение;
		нКноп.Отображение = ОтображениеКнопки.Текст;
	Иначе
		//Если ТипОбъекта = "Справочники" ИЛИ ТипОбъекта = "Документы" ИЛИ ТипОбъекта = "РегистрыСведений" Тогда
			нКом = Форма.Команды.Добавить("Команда_ЗаписатьИЗакрыть");
			// &НаКлиенте (Команда)
			нКом.Действие = "ЗаписатьИЗакрыть";
			нКом.Заголовок = НСтр("ru='Записать и закрыть';en='Write and close'");
			
			нКноп = Форма.Элементы.Добавить("Кнопка_ЗаписатьИЗакрыть",Тип("КнопкаФормы"),Форма.Элементы["ФормаКоманднаяПанель"]);
			нКноп.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
			нКноп.КнопкаПоУмолчанию = Истина;
			нКноп.ИмяКоманды = "Команда_ЗаписатьИЗакрыть";
			нКноп.Картинка = БиблиотекаКартинок.ЗаписатьИЗакрыть;
			нКноп.Отображение = ОтображениеКнопки.Текст;
			//
			нКом = Форма.Команды.Добавить("Команда_Записать");
			// &НаКлиенте (Команда)
			нКом.Действие = "Записать";
			нКом.Заголовок = НСтр("ru='Записать';en='Write down'");
			
			нКноп = Форма.Элементы.Добавить("Кнопка_Записать",Тип("КнопкаФормы"),Форма.Элементы["ФормаКоманднаяПанель"]);
			нКноп.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
			нКноп.ИмяКоманды = "Команда_Записать";
			нКноп.Картинка = БиблиотекаКартинок.Записать;
			нКноп.Отображение = ОтображениеКнопки.Текст;
		//КонецЕсли;
		//
		Если ТипОбъекта = "Документы" Тогда 
			нКом = Форма.Команды.Добавить("Команда_Провести");
			// &НаКлиенте (Команда)
			нКом.Действие = "Провести";
			нКом.Заголовок = НСтр("ru='Провести';en='Hold'");
			
			нКноп = Форма.Элементы.Добавить("Кнопка_Провести",Тип("КнопкаФормы"),Форма.Элементы["ФормаКоманднаяПанель"]);
			нКноп.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
			нКноп.ИмяКоманды = "Команда_Провести";
			нКноп.Картинка = БиблиотекаКартинок.Провести;
			нКноп.Отображение = ОтображениеКнопки.КартинкаИТекст;
			//
		КонецЕсли;
		//
		Если ТипОбъекта = "Справочники" ИЛИ ТипОбъекта = "Документы" Тогда
			нКом = Форма.Команды.Добавить("Команда_Перечитать");
			// &НаКлиенте (Команда)
			нКом.Действие = "Перечитать";
			нКом.Заголовок = НСтр("ru='Перечитать';en='Reread'");
			
			нКноп = Форма.Элементы.Добавить("Кнопка_Перечитать",Тип("КнопкаФормы"),Форма.Элементы["ФормаКоманднаяПанель"]);
			нКноп.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
			нКноп.ИмяКоманды = "Команда_Перечитать";
			нКноп.Картинка = БиблиотекаКартинок.Перечитать;
			нКноп.Отображение = ОтображениеКнопки.Текст;
			нКноп.ТолькоВоВсехДействиях = Истина;
		КонецЕсли;
		//
		Если ТипОбъекта = "Документы" Тогда 
			нКом = Форма.Команды.Добавить("Команда_ОтменитьПроведение");
			// &НаКлиенте (Команда)
			нКом.Действие = "ОтменитьПроведение";
			нКом.Заголовок = НСтр("ru='Отменить проведение';en='To cancel the'");
			
			нКноп = Форма.Элементы.Добавить("Кнопка_ОтменитьПроведение",Тип("КнопкаФормы"),Форма.Элементы["ФормаКоманднаяПанель"]);
			нКноп.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
			нКноп.ИмяКоманды = "Команда_ОтменитьПроведение";
			нКноп.Картинка = БиблиотекаКартинок.ОтменаПроведения;
			нКноп.Отображение = ОтображениеКнопки.КартинкаИТекст;
			//
		КонецЕсли;
		//
		Если ТипОбъекта = "Справочники" ИЛИ ТипОбъекта = "Документы" Тогда
			нКом = Форма.Команды.Добавить("Команда_ПометитьНаУдаление");
			// &НаКлиенте (Команда)
			нКом.Действие = "ПометитьНаУдаление";
			нКом.Заголовок = НСтр("ru='Пометить на удаление / Снять пометку';en='Mark Delete / Unmark'");
			
			нКноп = Форма.Элементы.Добавить("Кнопка_ПометитьНаУдаление",Тип("КнопкаФормы"),Форма.Элементы["ФормаКоманднаяПанель"]);
			нКноп.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
			нКноп.ИмяКоманды = "Команда_ПометитьНаУдаление";
			нКноп.Картинка = БиблиотекаКартинок.ПометитьНаУдаление;
			нКноп.Отображение = ОтображениеКнопки.КартинкаИТекст;
			нКноп.ТолькоВоВсехДействиях = Истина;
		КонецЕсли;
	КонецЕсли;
	//
	нКом = Форма.Команды.Добавить("Команда_ОткрытьСправку");
	// &НаКлиенте (Команда)
	нКом.Действие = "торо_ОткрытьСправку";
	нКом.Заголовок = НСтр("ru='Справка';en='Help'");
	
	Если ВидФормы = "ФормаСписка" ИЛИ ВидФормы = "ФормаВыбора" Тогда
		нКноп = Форма.Элементы.Добавить("Кнопка_ОткрытьСправку",Тип("КнопкаФормы"),Форма.Элементы["СписокКоманднаяПанель"]);
	Иначе
		нКноп = Форма.Элементы.Добавить("Кнопка_ОткрытьСправку",Тип("КнопкаФормы"),Форма.Элементы["ФормаКоманднаяПанель"]);
	КонецЕсли;
	нКноп.Вид = ВидКнопкиФормы.КнопкаКоманднойПанели;
	нКноп.ИмяКоманды = "Команда_ОткрытьСправку";
	нКноп.Картинка = БиблиотекаКартинок.Справка;
	нКноп.Отображение = ОтображениеКнопки.Картинка;
	// >> [Деснол] [Ушаков А.Д.] [20.09.2019]
	нКноп.ТолькоВоВсехДействиях = Истина;
	// << [Деснол] [Ушаков А.Д.] [20.09.2019] 
	
	//
	Форма.КоманднаяПанель.ПодчиненныеЭлементы.ФормаСправка.Видимость = Ложь;
	Форма.КоманднаяПанель.ПодчиненныеЭлементы.ФормаСправка.Доступность = Ложь;
	//
КонецПроцедуры

Функция ПолучитьИмяБазовогоТипаПоТипуОбъекта(ТипОбъекта)
    
    МетаданныеТипа = Метаданные.НайтиПоТипу(ТипОбъекта);
    
    Если МетаданныеТипа = Неопределено Тогда
        
        Возврат "УдалениеОбъекта";
        
    ИначеЕсли Метаданные.РегистрыСведений.Содержит(МетаданныеТипа) Тогда
        
        Возврат "РегистрыСведений";
        
    ИначеЕсли Метаданные.Документы.Содержит(МетаданныеТипа) Тогда
        
        Возврат "Документы";
        
    ИначеЕсли Метаданные.Справочники.Содержит(МетаданныеТипа) Тогда
        
        Возврат "Справочники";    
        
    ИначеЕсли Метаданные.РегистрыНакопления.Содержит(МетаданныеТипа) Тогда
    
        Возврат "РегистрыНакопления";    
        
    ИначеЕсли Метаданные.РегистрыБухгалтерии.Содержит(МетаданныеТипа) Тогда
    
        Возврат "РегистрыБухгалтерии";    
       
    Иначе
       
        Возврат "";
        
    КонецЕсли;
            
КонецФункции

// [Строит динамический нелокализованный список для формы списка] 
Процедура ПостроитьДинамическийСписокформы(Форма)
	Если СтрНайти(Форма.Параметры.ТипМетаданных,"Регистр") > 0 Тогда 
		Возврат;
	КонецЕсли;
	//
	нТабл = Форма.Элементы.Добавить("Список",Тип("ТаблицаФормы"));
	нТабл.ПутьКДанным = "Список";
	нТабл.Высота = 3;
	нТабл.ВариантУправленияВысотой = ВариантУправленияВысотойТаблицы.ПоСодержимому;

	ЭтоФормаВыбора = Форма.Параметры.ВидФормы = "ФормаВыбора";
	
	ОсновнаяТаблицаИмя = Лев(Форма.Параметры.ТипМетаданных,СтрДлина(Форма.Параметры.ТипМетаданных)-1) + "." + Форма.Параметры.ТипОбъектаИБ;
	Форма.Список.ПроизвольныйЗапрос = Истина;
	Форма.Список.Основнаятаблица = ОсновнаяТаблицаИмя;
	СтандартныеРеквизиты = Новый Массив();
	СтандартныеРеквизиты.Добавить(Новый Структура("Имя,Тип","Ссылка",
		Новый ОписаниеТипов(Лев(Форма.Параметры.ТипМетаданных,СтрДлина(Форма.Параметры.ТипМетаданных)-1)+"Ссылка."+Форма.Параметры.ТипОбъектаИБ)));
	Если Форма.Параметры.ТипМетаданных = "Справочники" Тогда 
		// >> [Деснол] [Ушаков А.Д.] [20.09.2019]
		СтандартныеРеквизитыМета = Метаданные.Справочники[Форма.Параметры.ТипОбъектаИБ].СтандартныеРеквизиты;
		ДлинаНаименования = СтандартныеРеквизитыМета["Наименование"].Тип.КвалификаторыСтроки.Длина;
		СтандартныеРеквизиты.Добавить(Новый Структура("Имя,Тип","Наименование",Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(ДлинаНаименования))));
		
		Для каждого СтандартныйРеквизит Из СтандартныеРеквизитыМета Цикл
			Если СтандартныйРеквизит.Имя = "Код" Тогда
				ДлинаКода = СтандартныйРеквизит.Тип.КвалификаторыСтроки.Длина;
				СтандартныеРеквизиты.Добавить(Новый Структура("Имя,Тип","Код",Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(ДлинаКода))));
			КонецЕсли; 
		КонецЦикла; 
		
		//Если ЭтоФормаВыбора Тогда
		//	Для каждого СтандартныйРеквизит Из СтандартныеРеквизиты Цикл
		//		Если СтандартныйРеквизит.Имя = "Ссылка" Тогда
		//			СтандартныеРеквизиты.Удалить(СтандартныеРеквизиты.Найти(СтандартныйРеквизит));
		//		КонецЕсли; 
		//	КонецЦикла; 
		//КонецЕсли;
		
		//СтандартныеРеквизиты.Добавить(Новый Структура("Имя,Тип","Код",Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(50))));
		// << [Деснол] [Ушаков А.Д.] [20.09.2019] 
		СтандартныеРеквизиты.Добавить(Новый Структура("Имя,Тип","Предопределенный",Новый ОписаниеТипов("Булево")));
	ИначеЕсли Форма.Параметры.ТипМетаданных = "Документы" Тогда 
		СтандартныеРеквизиты.Добавить(Новый Структура("Имя,Тип","Дата",Новый ОписаниеТипов("Дата",,,,,Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя))));
		СтандартныеРеквизиты.Добавить(Новый Структура("Имя,Тип","Номер",Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(50))));
		СтандартныеРеквизиты.Добавить(Новый Структура("Имя,Тип","Проведен",Новый ОписаниеТипов("Булево")));
	КонецЕсли;
	СтандартныеРеквизиты.Добавить(Новый Структура("Имя,Тип","ПометкаУдаления",Новый ОписаниеТипов("Булево")));
	//СтандартныеРеквизиты.Добавить(Новый Структура("Имя,Тип","СтандартнаяКартинка",Новый ОписаниеТипов("Картинка")));
	//
	// >> [Деснол] [Ушаков А.Д.] [20.09.2019] 
	//ТекстЗапроса = "Выбрать 
	ТекстЗапроса = "//Локализация
	|Выбрать 
	// << [Деснол] [Ушаков А.Д.] [20.09.2019] 
	| //";

	Для Каждого Реквизит Из СтандартныеРеквизиты Цикл
		ТекстЗапроса = ТекстЗапроса + ",
		|	ТЧ."+Реквизит.Имя + " КАК "+Реквизит.Имя;
	КонецЦикла;
	
	// >> [Деснол] [Ушаков А.Д.] [20.09.2019]
	Если Не ЭтоФормаВыбора Тогда
		Для Каждого Реквизит Из Метаданные[Форма.Параметры.ТипМетаданных][Форма.Параметры.ТипОбъектаИБ].Реквизиты Цикл
			ТекстЗапроса = ТекстЗапроса + ",
			|	ТЧ."+Реквизит.Имя + " КАК "+Реквизит.Имя;
		КонецЦикла;
	КонецЕсли; 
	// << [Деснол] [Ушаков А.Д.] [20.09.2019] 
	//
	ТекстЗапроса = ТекстЗапроса + " 
	|	ИЗ " + ОсновнаяТаблицаИмя + " КАК ТЧ";
	Форма.Список.ТекстЗапроса = ТекстЗапроса;
	//
	Для Каждого Реквизит Из СтандартныеРеквизиты Цикл
		НЭлем = Форма.Элементы.Добавить(Реквизит.Имя, Тип("ПолеФормы"), Форма.Элементы["Список"]);
		Если Реквизит.Тип = Новый ОписаниеТипов("Булево") Тогда 
			НЭлем.Вид = ВидПоляФормы.ПолеФлажка;
		Иначе
			НЭлем.Вид = ВидПоляФормы.ПолеВвода;
		КонецЕсли;
		НЭлем.ПутьКДанным = "Список."+Реквизит.Имя;
		Если Реквизит.Имя = "Предопределенный" ИЛИ Реквизит.Имя = "ПометкаУдаления" ИЛИ Реквизит.Имя = "Проведен" Тогда 
			НЭлем.Видимость = Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Если ЭтоФормаВыбора Тогда
		Форма.Элементы.Ссылка.Видимость = Ложь;
		Форма.Список.УстановитьОбязательноеИспользование("Ссылка", Истина);
	КонецЕсли; 
	
	Если Не ЭтоФормаВыбора Тогда
		Для Каждого Реквизит Из Метаданные[Форма.Параметры.ТипМетаданных][Форма.Параметры.ТипОбъектаИБ].Реквизиты Цикл
			НЭлем = Форма.Элементы.Добавить(Реквизит.Имя, Тип("ПолеФормы"), Форма.Элементы["Список"]);
			Если Реквизит.Тип = Новый ОписаниеТипов("Булево") Тогда 
				НЭлем.Вид = ВидПоляФормы.ПолеФлажка;
			Иначе
				НЭлем.Вид = ВидПоляФормы.ПолеВвода;
			КонецЕсли;
			НЭлем.ПутьКДанным = "Список."+Реквизит.Имя;
		КонецЦикла;
	КонецЕсли; 
	//
	Форма.Элементы.Список.ПутьКДаннымКартинкиСтроки = "Список.СтандартнаяКартинка";
КонецПроцедуры

// [Возвращает перевод реквизита по ссылке и языку] 
Функция ПолучитьЗначениеРеквизитаОбъекта(ID, Реквизит, Язык)
	Отбор = Новый Структура("ID,Язык,Реквизит", ID, Язык, Реквизит); 
	НЗ = РегистрыСведений.торо_Переводы.Получить(Отбор);
	
	Значение = НЗ.Текст;
	
	Возврат Значение;
КонецФункции

// Проверяет, является ли текущий язык языком по умолчанию 
Функция ЭтоЯзыкПоУмолчанию()
	ТекущийЯзыкЭтоЯзыкПоУмолчанию = ПараметрыСеанса.торо_ТекущийЯзыкЭтоЯзыкПоУмолчанию;
	Возврат ТекущийЯзыкЭтоЯзыкПоУмолчанию;
КонецФункции

#КонецОбласти
